app/views/comments/_comment.html.slim

- @article.comments.each do |comment|
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 2]]