app/views/articles/_form.html.slim

  p
    = form.collection_select :category_id, Category.order(:name), :id, :name, class: 'span12'
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC