app/controllers/articles_controller.rb

  def index
    @articles = Article.all.order(:title)
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."title" ASC

  def create
    @article = Article.create(article_params)


    if @article.save
---
INSERT INTO "articles" ("title", "text", "category_id", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "articles" ("title", "text", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Sport news"], ["text", "some text"], ["category_id", 1], ["created_at", "2018-08-16 12:16:49.879660"], ["updated_at", "2018-08-16 12:16:49.879660"]]

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "sport-clipart-middle-school-6.jpg"], ["image_file_size", 213385], ["image_updated_at", "2018-08-16 14:26:58.097391"], ["updated_at", "2018-08-16 14:26:58.245099"], ["id", 2]]