app/controllers/users_controller.rb

INSERT INTO "users" ("nickname", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nickname", "Anton"], ["email", "blabla@bla.ru"], ["password_digest", "12345"], ["created_at", "2018-08-18 20:37:37.238213"], ["updated_at", "2018-08-18 20:37:37.238213"]]
---
  def create
    @user = User.create(user_params)