app/views/categories/show.html.erb


  <% @category.articles.each do |article| %>
---
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = ?  [["category_id", 1]]